/**
 * 节日数据配置表
 * @charset UTF-8
 * @Version 1.0.3
 */
//是否需要推送纪念日，需要填true，否则填false （不需要加引号）
let open =  true;
//法定节假日列表(每年根据国务院公布情况)
const legal = new Array(
      {
          name:'元旦',
          date: '01-01',
          repair: 0,
          holiday: ['12-30','12-31','01-01']
      },
      {
          name:'春节',
          date: '01-29',
          repair: ['02-04','02-18'],
          holiday: ['02-10','02-11','02-12','02-13','02-14','02-15','02-16','02-17']
      },
      {
          name:'清明节',
          date: '04-04',
          repair: ['04-07'],
          holiday: ['04-04','04-05','04-06']
      },
      {
          name:'劳动节',
          date: '05-01',
          repair: ['04-28','05-11'],
          holiday: ['05-01','05-02','05-03','05-04','05-05']
      },
      {
          name:'端午节',
          date: '06-10',
          repair: 0,
          holiday: ['06-08','06-09','06-10']
      },
      {
          name:'中秋节',
          date: '09-17',
          repair: ['09-14'],
          holiday: ['09-15','09-16','09-17']
      },
      {
          name:'国庆节',
          date: '10-01',
          repair: ['09-29','10-12'],
          holiday: ['10-01','10-02','10-03','10-04','10-05','10-06','10-07']
      }
  );

//阳历节日列表
const sFtv = new Array(
    {
        name:'情人节',
        date: '02-14'
    },
    {
        name:'妇女节',
        date: '03-08'
    },
    {
        name:'植树节',
        date: '03-12'
    },
    {
        name:'消费者权益日',
        date: '03-15'
    },
    {
        name:'愚人节',
        date: '04-01'
    },

    {
        name:'青年节',
        date: '05-04'
    },
    {
        name:'护士节',
        date: '05-12'
    },
    {
        name:'网络情人节',
        date: '05-20'
    },
    {
        name:'儿童节',
        date: '06-01'
    },
    {
        name:'香港回归纪念日',
        date: '07-01'
    },
    {
        name:'建军节',
        date: '08-01'
    },
    {
        name:'抗战胜利纪念日',
        date: '09-03'
    },
    {
        name:'教师节',
        date: '09-10'
    },
    {
        name:'九一八事变纪念日',
        date: '09-18'
    },
    {
        name:'万圣节',
        date: '11-01'
    },
    {
        name:'网络单身节',
        date: '11-11'
    },
    {
        name:'澳门回归纪念日',
        date: '12-20'
    },
    {
        name:'平安夜',
        date: '12-24'
    },
    {
        name:'圣诞节',
        date: '12-25'
    },
);

//阴历节日列表
const lFtv = new Array(
  {
      name:'上元节',
      date: '01-15'
  },
  {
      name:'龙头节',
      date: '02-02'
  },
  {
      name:'佛诞节',
      date: '04-08'
  },
  {
      name:'七夕节',
      date: '07-07'
  },
  {
      name:'中元节',
      date: '07-15'
  },
  {
      name:'重阳节',
      date: '09-09'
  },
  {
      name:'下元节',
      date: '10-15'
  },
  {
      name:'腊八节',
      date: '12-08'
  },
  {
      name:'北小年',
      date: '12-23'
  },
  {
      name:'南小年',
      date: '12-24'
  },
  {
      name:'江浙沪小年',
      date: '12-28'
  },
  {
      name:'除夕',
      date: '12-29'
  }
);

//二十四节气列表
const term = new Array(
  {
      sort: 1,
      name:'立春',
      month: '02',
      describe: '第1个节气-立春：春天的开始，万物复苏，气温回升，冰雪开始融化，大地渐渐变得温暖，草木萌芽，阳光明媚，人们开始忙碌农事，迎接新一年的希望。'
  },
  {
      sort: 2,
      name:'雨水',
      month: '02',
      describe: '第2个节气-雨水：气温逐渐回升，降雨增多，冰雪开始融化，河流逐渐解冻，万物开始复苏，农田开始变得湿润，人们开始准备春耕，迎接新一年的播种季节。'
  },
  {
      sort: 3,
      name:'惊蛰',
      month: '03',
      describe: '第3个节气-惊蛰：天气转暖，春雷开始震响，蛰伏在泥土里的各种冬眠动物将苏醒过来，开始活动起来。'
  },
  {
      sort: 4,
      name:'春分',
      month: '03',
      describe: '第4个节气-春分：这一天刚好是春季九十天的中分点，南北两半球昼夜相等。'
  },
  {
      sort: 6,
      name:'谷雨',
      month: '04',
      describe: '第6个节气-谷雨：雨水生五谷，雨水滋润大地，五谷得以生长。'
  },
  {
      sort: 7,
      name:'立夏',
      month: '05',
      describe: '第7个节气-立夏：夏天的开始，从此进入夏天，万物生长旺盛，气温显著升高，炎暑将临，雷雨增多。'
  },
  {
      sort: 8,
      name:'小满',
      month: '05',
      describe: '第8个节气-小满：从小满开始，大麦，冬小麦等夏收作物，已经结果、籽粒饱满，但尚未成熟。'
  },
  {
      sort: 9,
      name:'芒种',
      month: '06',
      describe: '第9个节气-芒种：这时最适合播种有芒的谷类作物，如晚谷、黍、稷等。'
  },
  {
      sort: 10,
      name:'夏至',
      month: '06',
      describe: '第10个节气-夏至：夏至点时，阳光几乎直射北回归线上空，北半球正午太阳最高。'
  },
  {
      sort: 11,
      name:'小暑',
      month: '07',
      describe: '第11个节气-小暑：天气逐渐变得炎热起来，长江流域和中国南方的许多地方会出现高温天气，最高温度通常在35℃左右。'
  },
  {
      sort: 12,
      name:'大暑',
      month: '07',
      describe: '第12个节气-大暑：一年中最热的节气，长江流域的许多地方，经常出现40℃高温天气，要做好防暑降温工作。'
  },
  {
      sort: 13,
      name:'立秋',
      month: '08',
      describe: '第13个节气-立秋：从这一天起秋天开始，秋高气爽，月明风清，此后，气温由最热逐渐下降。'
  },
  {
      sort: 14,
      name:'处暑',
      month: '08',
      describe: '第14个节气-处暑：这时夏天火热到头了，暑气就要散了，它是温度下降的一个转折点。'
  },
  {
      sort: 15,
      name:'白露',
      month: '09',
      describe: '第15个节气-白露：气温开始明显下降，早晨的露水凝结成白色的小水珠，天气转凉，昼夜温差加大，秋意渐浓，植物开始凋零，收获季节来临。'
  },
  {
      sort: 16,
      name:'秋分',
      month: '09',
      describe: '第16个节气-秋分：这一天刚好是秋季九十天的一半，阳光几乎直射赤道，昼夜几乎相等。'
  },
  {
      sort: 17,
      name:'寒露',
      month: '10',
      describe: '第17个节气-寒露：气温逐渐降低，露水开始变得寒冷，昼夜温差加大，早晚天气变凉，树叶开始变黄，秋意浓厚。'
  },
  {
      sort: 18,
      name:'霜降',
      month: '10',
      describe: '第18个节气-霜降：秋季的最后一个节气，意味着天气逐渐转冷，早晨会有霜冻出现，此时要注意保暖，及时收获农作物，防止霜冻带来的损害。'
  },
  {
      sort: 19,
      name:'立冬',
      month: '11',
      describe: '第19个节气-立冬：这一天冬季的开始，气温进一步下降，天气逐渐寒冷，人们要注意保暖，增加营养，增强抵抗力。'
  },
  {
      sort: 20,
      name:'小雪',
      month: '11',
      describe: '第20个节气-小雪：气温继续下降，开始出现初雪，但降雪量较小，此时天气寒冷干燥，人们需注意保暖防寒，保持室内湿润。'
  },
  {
      sort: 21,
      name:'大雪',
      month: '12',
      describe: '第21个节气-大雪：大雪前后，黄河流域一带渐有积雪，而北方，已是“千里冰封，万里雪飘”的严冬了。'
  },
  {
      sort: 22,
      name:'冬至',
      month: '12',
      describe: '第22个节气-冬至：这一天，阳光几乎直射南回归线，北半球白昼最短，黑夜最长。'
  },
  {
      sort: 23,
      name:'小寒',
      month: '01',
      describe: '第23个节气-小寒：气温显著下降，寒冷加剧，但还未达到最冷，冷风和霜冻频繁，预示着严冬即将来临。'
  },
  {
      sort: 24,
      name:'大寒',
      month: '01',
      describe: '第24个节气-大寒：一年中最冷的时节，气温降至最低，寒风刺骨，常有霜冻和冰雪，迎接最严酷的冬季。'
  }
);

//特殊节日列表
const special = new Array(
  {
      name:'母亲节',
      date: '05/2/7'
  },
  {
      name:'父亲节',
      date: '06/3/7'
  },
  {
      name:'感恩节',
      date: '11/4/4'
  }
);

  module.exports = {
    legal,          // 法定节假日列表
    sFtv,           // 阳历节日列表
    lFtv,           // 阴历节日列表
    term,           // 二十四节气列表
    special,        // 特殊节日列表
  }