/**
 * 节日数据配置表
 * @charset UTF-8
 * @Version 1.0.3
 */
//是否需要推送纪念日，需要填true，否则填false （不需要加引号）
let open =  true;
//法定节假日列表(根据国务院每年公布情况)
const legal = new Array(
      {
          name:'元旦',
          date: '01-01',
          freeway: 0,
          repair: ['01-04'],
          holiday: ['01-01','01-02','01-03']
      },
      {
          name:'春节',
          date: '02-17',
          freeway: 1,
          repair: ['02-14','02-28'],
          holiday: ['02-15','02-16','02-17','02-18','02-19','02-20','02-21','02-22','02-23']
      },
      {
          name:'清明节',
          date: '04-05',
          freeway: 1,
          repair: 0,
          holiday: ['04-04','04-05','04-06']
      },
      {
          name:'劳动节',
          date: '05-01',
          freeway: 1,
          repair: ['05-09'],
          holiday: ['05-01','05-02','05-03','05-04','05-05']
      },
      {
          name:'端午节',
          date: '06-19',
          freeway: 0,
          repair: 0,
          holiday: ['06-19','06-20','06-21']
      },
      {
          name:'中秋节',
          date: '09-25',
          freeway: 0,
          repair: 0,
          holiday: ['09-25','09-26','09-27']
      },
      {
          name:'国庆节',
          date: '10-01',
          freeway: 1,
          repair: ['09-20','10-10'],
          holiday: ['10-01','10-02','10-03','10-04','10-05','10-06','10-07']
      }
  );

//阳历节日列表
const sFtv = new Array(
    {
      name: '警察节',
      date: '01-10'
    },
    {
      name: '气象节',
      date: '02-10'
    },
    {
      name: '情人节',
      date: '02-14'
    },
    {
      name: '妇女节',
      date: '03-08'
    },
    {
      name: '植树节',
      date: '03-12'
    },
    {
      name: '国医节',
      date: '03-17'
    },
    {
      name: '愚人节',
      date: '04-01'
    },
    {
      name: '青年节',
      date: '05-04'
    },
    {
      name: '护士节',
      date: '05-12'
    },
    {
      name: '520情人节',
      date: '05-20'
    },
    {
      name: '儿童节',
      date: '06-01'
    },
    {
      name: '618购物节',
      date: '06-18'
    },
    {
      name: '建党节',
      date: '07-01'
    },
    {
      name: '建军节',
      date: '08-01'
    },
    {
      name: '男子节',
      date: '08-08'
    },
    {
      name: '医师节',
      date: '08-19'
    },
    {
      name: '教师节',
      date: '09-10'
    },
    {
      name: '老人节',
      date: '10-06'
    },
    {
      name: '盲人节',
      date: '10-15'
    },
    {
      name:'程序员节',
      date: '10-24'
    },
    {
      name:'万圣节',
      date: '11-01'
    },
    {
      name:'双十一购物节',
      date: '11-11'
    },
    {
      name: '大学生节',//世界学生节
      date: '11-17'
    },
    {
      name:'平安夜',
      date: '12-24'
    },
    {
      name:'圣诞节',
      date: '12-25'
    }
);

//阴历节日列表
const lFtv = new Array(
  {
      name:'上元节',
      date: '01-15'
  },
  {
      name:'龙头节',
      date: '02-02'
  },
  {
      name:'上巳节',
      date: '03-03'
  },
  {
      name:'佛诞节',
      date: '04-08'
  },
  {
      name:'七夕节',
      date: '07-07'
  },
  {
      name:'中元节',
      date: '07-15'
  },
  {
      name:'重阳节',
      date: '09-09'
  },
  {
      name:'下元节',
      date: '10-15'
  },
  {
      name:'腊八节',
      date: '12-08'
  },
  {
      name:'北小年',
      date: '12-23'
  },
  {
      name:'南小年',
      date: '12-24'
  },
  {
      name:'江浙沪小年',
      date: '12-28'
  },
  {
      name:'除夕',
      date: '12-29'
  }
);

//二十四节气列表
const term = new Array(
  {
      sort: 1,
      name:'立春',
      month: '02',
      describe: '第1个节气-立春：春天的开始，万物复苏，气温回升，草木萌芽，阳光明媚，冰雪开始融化，大地渐渐变得温暖，迎接新一年的希望。'
  },
  {
      sort: 2,
      name:'雨水',
      month: '02',
      describe: '第2个节气-雨水：降雨增多，气温回升，河流解冻，万物复苏，冰雪开始融化，迎接新一年的播种季节。'
  },
  {
      sort: 3,
      name:'惊蛰',
      month: '03',
      describe: '第3个节气-惊蛰：天气转暖，春雷震响，蛰伏在泥土里的各种冬眠动物将苏醒过来，开始活动起来。'
  },
  {
      sort: 4,
      name:'春分',
      month: '03',
      describe: '第4个节气-春分：这一天，太阳直射赤道，全球各地的昼夜时间几乎相等，白天和夜晚都大约为12小时。此时北半球白天时间开始逐渐变长，气温逐渐回暖。'
  },
  {
      sort: 6,
      name:'谷雨',
      month: '04',
      describe: '第6个节气-谷雨：雨水生五谷，雨水滋润大地，五谷得以生长。'
  },
  {
      sort: 7,
      name:'立夏',
      month: '05',
      describe: '第7个节气-立夏：夏天的开始，从此进入夏天，万物生长旺盛，气温显著升高，炎暑将临，雷雨增多。'
  },
  {
      sort: 8,
      name:'小满',
      month: '05',
      describe: '第8个节气-小满：从小满开始，大麦，冬小麦等夏收作物，已经结果、籽粒饱满，但尚未成熟。'
  },
  {
      sort: 9,
      name:'芒种',
      month: '06',
      describe: '第9个节气-芒种：这时最适合播种有芒的谷类作物，如晚谷、黍、稷等。'
  },
  {
      sort: 10,
      name:'夏至',
      month: '06',
      describe: '第10个节气-夏至：这一天，太阳直射北回归线，这意味着北半球的白天时间最长，夜晚时间最短。从这一天开始，北半球的白天时间开始逐渐缩短。'
  },
  {
      sort: 11,
      name:'小暑',
      month: '07',
      describe: '第11个节气-小暑：天气逐渐变得炎热起来，长江流域和中国南方的许多地方会出现高温天气，最高温度通常在35℃左右。'
  },
  {
      sort: 12,
      name:'大暑',
      month: '07',
      describe: '第12个节气-大暑：一年中最热的节气，长江流域的许多地方，经常出现40℃高温天气，要做好防暑降温工作。'
  },
  {
      sort: 13,
      name:'立秋',
      month: '08',
      describe: '第13个节气-立秋：从这一天起秋天开始，秋高气爽，月明风清，气温由最热逐渐下降。'
  },
  {
      sort: 14,
      name:'处暑',
      month: '08',
      describe: '第14个节气-处暑：这时夏天火热到头，暑气即将散去，它是温度下降的一个转折点。'
  },
  {
      sort: 15,
      name:'白露',
      month: '09',
      describe: '第15个节气-白露：气温开始明显下降，植物开始凋零，早晨的露水凝结成白色的小水珠，天气转凉，秋意渐浓，昼夜温差加大。'
  },
  {
      sort: 16,
      name:'秋分',
      month: '09',
      describe: '第16个节气-秋分：这一天，太阳直射赤道，全球各地的昼夜时间几乎相等，此时北半球白天时间开始逐渐缩短，气温逐渐降低。'
  },
  {
      sort: 17,
      name:'寒露',
      month: '10',
      describe: '第17个节气-寒露：气温逐渐降低，露水开始变得寒冷，昼夜温差加大，早晚天气变凉，树叶开始变黄，秋意浓厚。'
  },
  {
      sort: 18,
      name:'霜降',
      month: '10',
      describe: '第18个节气-霜降：秋季的最后一个节气，意味着天气逐渐转冷，早晨会有霜冻出现，此时要注意保暖。'
  },
  {
      sort: 19,
      name:'立冬',
      month: '11',
      describe: '第19个节气-立冬：这一天冬季的开始，气温进一步下降，天气逐渐寒冷，注意保暖。'
  },
  {
      sort: 20,
      name:'小雪',
      month: '11',
      describe: '第20个节气-小雪：气温继续下降，可能出现小范围、轻微的降雪，雪量并不多，此时天气寒冷干燥，注意保暖防寒。'
  },
  {
      sort: 21,
      name:'大雪',
      month: '12',
      describe: '第21个节气-大雪：气温普遍下降至零度以下，降雪增多，此时天气持续寒冷干燥，注意保暖防寒。'
  },
  {
      sort: 22,
      name:'冬至',
      month: '12',
      describe: '第22个节气-冬至：这一天，太阳直射南回归线，此时南半球的昼长夜短，而北半球则是昼短夜长，北半球的白天时间开始逐渐变长。'
  },
  {
      sort: 23,
      name:'小寒',
      month: '01',
      describe: '第23个节气-小寒：气温显著下降，寒冷加剧，但还未达到最冷，冷风和霜冻频繁，预示着严冬即将来临。'
  },
  {
      sort: 24,
      name:'大寒',
      month: '01',
      describe: '第24个节气-大寒：一年中最冷的时节，气温降至最低，寒风刺骨，常有霜冻和冰雪，迎接最严酷的冬季。'
  }
);

//特殊节日列表
const special = new Array(
    {
      name:'世界防治麻风病日',//每年1月的最后一个星期日
      date: '01/4/7'
  },
  {
      name:'母亲节',//每年5月的第二个星期日
      date: '05/2/7'
  },
  {
      name:'全国助残日',//每年5月第三个星期日
      date: '05/3/7'
  },
  {
      name:'父亲节',//每年6月的第三个星期日
      date: '06/3/7'
  },
  {
      name:'国际和平日',//每年9月的第三个星期二
      date: '09/3/2'
  },
  {
      name:'国际聋人节',//世界儿童日|每年9月的第四个星期日
      date: '09/4/7'
  },
  {
      name:'国际住房日',//每年10月的第一个星期一
      date: '10/1/1'
  },
  {
      name:'国际减轻自然灾害日',//每年10月的第二个星期三
      date: '10/2/3'
  },
  {
      name:'感恩节',//每年11月的第四个星期四
      date: '11/4/4'
  }
);
//国际节日列表
const internation = new Array(
    {
      name: '周恩来逝世纪念日',//1976年
      date: '01-08'
    },
    {
      name: '国际海关日',
      date: '01-26'
    },
    {
      name: '世界湿地日',
      date: '02-02'
    },
    {
      name: '国际海豹日',
      date: '03-01'
    },
    {
      name: '全国爱耳日',
      date: '03-03'
    },
    {
      name: '周恩来诞辰纪念日', //1898年、学雷锋纪念日
      date: '03-05'
    },
    {
      name:'孙中山逝世纪念日', //1925年
      date: '03-12'
    },
    {
      name:'国际警察日',
      date: '03-14'
    },
    {
      name:'消费者权益日',
      date: '03-15'
    },
    {
      name:'国际航海日',
      date: '03-17'
    },
    {
      name: '世界睡眠日',//世界森林日, 消除种族歧视国际日', 世界儿歌日
      date: '03-21'
    },
    {
      name: '世界水日',
      date: '03-22'
    },
    {
      name: '世界气象日',
      date: '03-23'
    },
    {
      name: '世界防治结核病日',
      date: '03-24'
    },
    {
      name: '学生安全教育日',
      date: '03-25'
    },
    {
      name: '世界卫生日',
      date: '04-07'
    },
    {
      name: '世界地球日',
      date: '04-22'
    },
    {
      name: '世界图书和版权日',
      date: '04-23'
    },
    {
      name: '中国航天日',//亚非新闻工作者日
      date: '04-24'
    },
    {
      name: '知识产权日',
      date: '04-26'
    },
    {
      name:'碘缺乏病防治日',
      date: '05-05'
    },
    {
      name:'世界红十字日',
      date: '05-08'
    },
    {
      name:'国际家庭日',
      date: '05-15'
    },
    {
      name:'国际电信日',
      date: '05-17'
    },
    {
      name:'国际博物馆日',
      date: '05-18'
    },
    {
      name:'全国学生营养日',
      date: '05-20'
    },
    {
      name:'国际牛奶日',
      date: '05-23'
    },
    {
      name: '世界无烟日',
      date: '05-31'
    },
    {
      name: '世界环境日',
      date: '06-05'
    },
    {
      name: '全国爱眼日',
      date: '06-06'
    },
    {
      name: '治荒漠化和干旱日',
      date: '06-17'
    },
    {
      name: '国际奥林匹克日',
      date: '06-23'
    },
    {
      name: '全国土地日',
      date: '06-25'
    },
    {
      name: '国际禁毒日',
      date: '06-26'
    },
    {
      name: '香港回归纪念日',//1997年、 中国共产党诞辰、世界建筑日
      date: '07-01'
    },
    {
      name: '国际体育记者日',
      date: '07-02'
    },
    {
      name: '世界人口日',
      date: '07-11'
    },
    {
      name:'抗日战争胜利纪念日', //1945年
      date: '09-03'
    },
    {
      name:'国际扫盲日',
      date: '09-08'
    },
    {
      name:'毛泽东逝世纪念日', //1976年
      date: '09-09'
    },
    {
      name:'世界清洁地球日',
      date: '09-14'
    },
    {
      name:'国际臭氧层保护日',
      date: '09-16'
    },
    {
      name:'九一八事变纪念日', //1931年
      date: '09-18'
    },
    {
      name: '国际爱牙日',
      date: '09-20'
    },
    {
      name: '国际和平日',
      date: '09-21'
    },
    {
      name: '世界旅游日',
      date: '09-27'
    },
    {
      name: '孔子诞辰纪念日', //公元前551年
      date: '09-28'
    },
    {
      name: '中国烈士纪念日',
      date: '09-30'
    },
    {
      name: '世界音乐日',//国际老人节
      date: '10-01'
    },
    {
      name: '国际和平斗争日',
      date: '10-02'
    },
    {
      name: '世界动物日',
      date: '10-04'
    },
    {
      name: '全国高血压日',//世界视觉日
      date: '10-08'
    },
    {
      name: '世界邮政日',//万国邮联日
      date: '10-09'
    },
    {
      name: '辛亥革命纪念日',//1911年、世界精神卫生日
      date: '10-10'
    },
    {
      name: '世界保健日',
      date: '10-13'
    },
    {
      name: '世界标准日',
      date: '10-14'
    },
    {
      name: '世界粮食日',
      date: '10-16'
    },
    {
      name: '世界消除贫困日',
      date: '10-17'
    },
    {
      name: '世界传统医药日',
      date: '10-22'
    },
    {
      name: '联合国日',
      date: '10-24'
    },
    {
      name: '台湾光复/抗美援朝纪念日',
      date: '10-25'
    },
    {
      name: '世界勤俭日',
      date: '10-31'
    },
    {
      name: '中国记者日',
      date: '11-08'
    },
    {
      name: '全国消防日',
      date: '11-09'
    },
    {
      name: '孙中山诞辰纪念日',//1866年
      date: '11-12'
    },
    {
      name: '世界糖尿病日',
      date: '11-14'
    },
    {
      name: '国际宽容日',
      date: '11-16'
    },
    {
      name: '世界问候日',//世界电视日
      date: '11-21'
    },
    {
      name: '世界艾滋病日',
      date: '12-01'
    },
    {
      name: '中国宪法日',
      date: '12-04'
    },
    {
      name: '国际残疾人日',
      date: '12-03'
    },
    {
      name: '国际志愿者日',
      date: '12-05'
    },
    {
      name: '国际儿童电视日',
      date: '12-08'
    },
    {
      name: '世界足球日',
      date: '12-09'
    },
    {
      name: '世界人权日',
      date: '12-10'
    },
    {
      name: '西安事变纪念日',//1936年
      date: '12-12'
    },
    {
      name: '南京大屠杀纪念日',//1937年
      date: '12-13'
    },
    {
      name:'澳门回归纪念日',//1999年
      date: '12-20'
    },
    {
      name:'国际篮球日',
      date: '12-21'
    },
    {
      name:'毛泽东诞辰纪念日',//1898年
      date: '12-26'
    }
);

  module.exports = {
    legal,          // 法定节假日列表
    sFtv,           // 阳历节日列表
    lFtv,           // 阴历节日列表
    term,           // 二十四节气列表
    special,        // 特殊节日列表
    internation,    // 国际节日列表
  }